---

C#Visual BasicVisual C++

Revit 2024 API
---
Edge..::..GetEndPointReference Method
Edge Class See Also Send Feedback
---

Returns a stable reference to the start or the end point of the edge.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public Reference GetEndPointReference(
    	int index
    )

Visual Basic
---

    Public Function GetEndPointReference ( _
    	index As Integer _
    ) As Reference

Visual C++
---

    public:
    Reference^ GetEndPointReference(
    	int index
    )

#### Parameters

index
    Type: System..::..Int32Use 0 for the start point; 1 for the end point.

#### Return Value

Reference to the point or nullNothingnullptra null reference (Nothing in Visual Basic) if reference cannot be obtained.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the specified index is not 0 or 1. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the object is internally marked as read-only in the setter. |

# See Also

Edge Class

Autodesk.Revit.DB Namespace